# <center>Using PostgreSQL Upsert</center>

### Author:  Bryan Cafferky  - For Demonstration Purposes Only

### Not intended for production use.

### If you don't have SQLAlchemy installed uncomment one fo the 2 cells below and execute it to install SQLLAlchemy.

In [ ]:
# pip install sqlalchemy  # Run only if you do not have SQLAlchemy installed!

In [ ]:
# conda install -c anaconda sqlalchemy # Using Conda - Run only if you do not have SQLAlchemy installed!

### PostgreSQL is CASE SENSITIVE so we will stick to lower case.

### Connecting using Windows Authentication

In [16]:
from sqlalchemy import create_engine

# connection string: driver://username:password@server/database
conn = create_engine('mssql+pyodbc://DESKTOP-TG2VLSU\SQL2017/AdventureWorksDW2017?driver=SQL+Server+Native+Client+11.0')

In [2]:
from sqlalchemy import create_engine

# connection string: driver://username:password@server/database
conn = create_engine('mssql+pyodbc://bryan:bryan@DESKTOP-TG2VLSU\SQL2017/AdventureWorksDW2017?driver=SQL+Server+Native+Client+11.0')

### We need to create the table with a primary key before saving data to it.
### The Primary Key uniquely identifies each row which we need so we can tell PostgreSQL which rows to Update or Delete.

In [3]:
conn.execute('DROP TABLE IF EXISTS Youtube_Customer')
conn.execute('DROP TABLE IF EXISTS Youtube_Custtrans')

In [4]:
conn.execute('''
CREATE TABLE Youtube_Customer (
    CustomerKey   INTEGER PRIMARY KEY NOT NULL,
    LastName      VARCHAR(150),
    BirthDate     DATE,
    MaritalStatus CHAR(1),
    YearlyIncome  DECIMAL(10,2),
    ModifiedDate  DATE,
    ETLLastUpdate DATETIME DEFAULT GetDate() 
);
''')

In [5]:
conn.execute('''
CREATE TABLE Youtube_Custtrans (
    CustomerKey   INTEGER PRIMARY KEY NOT NULL,
    LastName      VARCHAR(150),
    BirthDate     DATE,
    MaritalStatus CHAR(1),
    YearlyIncome  DECIMAL(10,2),
    ActionInd     CHAR(1),
    ModifiedDate  DATE
);
''')

In [6]:
import pandas as pd

### Load the master table...

In [7]:
custdf = pd.read_csv("data/dimcustomer.csv", index_col = False)

In [8]:
custdf

   customerkey lastname   birthdate maritalstatus  yearlyincome modifieddate
0        11000     Yang  1971-10-06             M       90000.0   2019-01-01
1        11001    Huang  1976-05-10             S       60000.0   2019-01-01
2        11002   Torres  1971-02-09             M       60000.0   2019-01-01
3        11003      Zhu  1973-08-14             S       70000.0   2019-01-01

### Save the dataframe to a table...

### Warning!!! Do not use if_exists='replace' or you will lose the primary key because the table gets dropped and created again!

In [9]:
custdf.to_sql('Youtube_Customer', conn, if_exists='append', index = False)

In [10]:
pd.read_sql_query("select * from Youtube_Customer", conn)

,CustomerKey,LastName,BirthDate,MaritalStatus,YearlyIncome,ModifiedDate,ETLLastUpdate
0,11000,Yang,1971-10-06,M,90000.0,2019-01-01,2021-06-28 09:15:21.537
1,11001,Huang,1976-05-10,S,60000.0,2019-01-01,2021-06-28 09:15:21.540
2,11002,Torres,1971-02-09,M,60000.0,2019-01-01,2021-06-28 09:15:21.540
3,11003,Zhu,1973-08-14,S,70000.0,2019-01-01,2021-06-28 09:15:21.543

#### Getting meta data...

In [11]:
# Get table schema...
import pandas as pd 

pd.read_sql_query("""
SELECT * FROM information_schema.columns
WHERE table_name = 'Youtube_Customer'
ORDER BY ordinal_position
""", conn)

,TABLE_CATALOG,TABLE_SCHEMA,TABLE_NAME,COLUMN_NAME,ORDINAL_POSITION,COLUMN_DEFAULT,IS_NULLABLE,DATA_TYPE,CHARACTER_MAXIMUM_LENGTH,CHARACTER_OCTET_LENGTH,...,DATETIME_PRECISION,CHARACTER_SET_CATALOG,CHARACTER_SET_SCHEMA,CHARACTER_SET_NAME,COLLATION_CATALOG,COLLATION_SCHEMA,COLLATION_NAME,DOMAIN_CATALOG,DOMAIN_SCHEMA,DOMAIN_NAME
0,AdventureWorksDW2017,dbo,Youtube_Customer,CustomerKey,1,None,NO,int,NaN,NaN,...,NaN,None,None,None,None,None,None,None,None,None
1,AdventureWorksDW2017,dbo,Youtube_Customer,LastName,2,None,YES,varchar,150.0,150.0,...,NaN,None,None,iso_1,None,None,SQL_Latin1_General_CP1_CI_AS,None,None,None
2,AdventureWorksDW2017,dbo,Youtube_Customer,BirthDate,3,None,YES,date,NaN,NaN,...,0.0,None,None,None,None,None,None,None,None,None
3,AdventureWorksDW2017,dbo,Youtube_Customer,MaritalStatus,4,None,YES,char,1.0,1.0,...,NaN,None,None,iso_1,None,None,SQL_Latin1_General_CP1_CI_AS,None,None,None
4,AdventureWorksDW2017,dbo,Youtube_Customer,YearlyIncome,5,None,YES,decimal,NaN,NaN,...,NaN,None,None,None,None,None,None,None,None,None
5,AdventureWorksDW2017,dbo,Youtube_Customer,ModifiedDate,6,None,YES,date,NaN,NaN,...,0.0,None,None,None,None,None,None,None,None,None
6,AdventureWorksDW2017,dbo,Youtube_Customer,ETLLastUpdate,7,(getdate()),YES,datetime,NaN,NaN,...,3.0,None,None,None,None,None,None,None,None,None

### Lets load the transaction file...

In [12]:
transdf = pd.read_csv("data/dimcustomertransactions.csv", index_col = None)
transdf

,customerkey,lastname,birthdate,maritalstatus,yearlyincome,actionind,modifieddate
0,11000,Yang,1971-10-06,M,250000.0,U,2020-01-01
1,11001,Jones,1976-05-10,S,360000.0,U,2019-02-01
2,333301,Murhpy,1975-02-09,M,33000.0,A,2018-01-01
3,333302,Jain,1980-01-09,M,28000.0,A,2020-02-01
4,11002,Torres,1971-02-09,M,60000.0,D,2020-02-01

In [13]:
transdf.to_sql('Youtube_Custtrans', conn, if_exists='append', index = False)
pd.read_sql_query("select * from Youtube_Custtrans", conn)

,CustomerKey,LastName,BirthDate,MaritalStatus,YearlyIncome,ActionInd,ModifiedDate
0,11000,Yang,1971-10-06,M,250000.0,U,2020-01-01
1,11001,Jones,1976-05-10,S,360000.0,U,2019-02-01
2,11002,Torres,1971-02-09,M,60000.0,D,2020-02-01
3,333301,Murhpy,1975-02-09,M,33000.0,A,2018-01-01
4,333302,Jain,1980-01-09,M,28000.0,A,2020-02-01

### Let's update the customer table with the transactions.
- Add    - If the customer is not found, insert transaction as new customer.
- Change - If the customer is found, update the existing customer with the transaction data.
- Delete - If the DropInd = 'Y', remove the customer row.

#### Note:  You must supply column names to allow the ETLLastUpdate to Default...

_____

## Upserting from a transaction table...

####  - You can filter on the transaction table in the query.
####  - Notice we do not update BirthDate.
AND UPPER(SOURCE.ActionInd) <> 'D' 

OUTPUT $action, Inserted.CustomerKey, Inserted.LastName,
    Inserted.ModifiedDate, Deleted.CustomerKey,  
    Deleted.LastName, Deleted.ModifiedDate;   
    
     SELECT CustomerKey, LastName, BirthDate, MaritalStatus, YearlyIncome, ModifiedDate
  FROM Youtube_Custtrans

In [17]:
sql = '''
MERGE Youtube_Customer  AS TARGET
USING Youtube_Custtrans AS SOURCE
ON (TARGET.CustomerKey = SOURCE.CustomerKey)
WHEN NOT MATCHED BY TARGET 
   THEN  INSERT (CustomerKey, LastName, BirthDate, MaritalStatus, YearlyIncome, ModifiedDate)  
         VALUES (SOURCE.CustomerKey, SOURCE.LastName, SOURCE.BirthDate, 
                 SOURCE.MaritalStatus, SOURCE.YearlyIncome, 
                 SOURCE.ModifiedDate)
WHEN MATCHED AND UPPER(SOURCE.ActionInd) <> 'D'  
   THEN UPDATE SET 
        LastName      = SOURCE.LastName,
        MaritalStatus = SOURCE.MaritalStatus,
        YearlyIncome  = SOURCE.YearlyIncome, 
        ModifiedDate  = SOURCE.ModifiedDate,
        ETLLastUpdate = GetDate()
WHEN MATCHED
   THEN DELETE;  
   
COMMIT;
'''

print(sql)

MERGE Youtube_Customer  AS TARGET
USING Youtube_Custtrans AS SOURCE
ON (TARGET.CustomerKey = SOURCE.CustomerKey)
WHEN NOT MATCHED BY TARGET
   THEN  INSERT (CustomerKey, LastName, BirthDate, MaritalStatus, YearlyIncome, ModifiedDate)
         VALUES (SOURCE.CustomerKey, SOURCE.LastName, SOURCE.BirthDate,
                 SOURCE.MaritalStatus, SOURCE.YearlyIncome,
                 SOURCE.ModifiedDate)
WHEN MATCHED AND UPPER(SOURCE.ActionInd) <> 'D'
   THEN UPDATE SET
        LastName      = SOURCE.LastName,
        MaritalStatus = SOURCE.MaritalStatus,
        YearlyIncome  = SOURCE.YearlyIncome,
        ModifiedDate  = SOURCE.ModifiedDate,
        ETLLastUpdate = GetDate()
WHEN MATCHED
   THEN DELETE;

COMMIT;

In [12]:
sql = '''
BEGIN TRAN;

INSERT INTO Youtube_Customer (CustomerKey, LastName, BirthDate, MaritalStatus, YearlyIncome, ModifiedDate)
  SELECT CustomerKey, LastName, BirthDate, MaritalStatus, YearlyIncome, ModifiedDate
  FROM Youtube_Custtrans
  WHERE ActionInd in ('A');     
                 
COMMIT;                        
'''

print(sql)

BEGIN TRAN;

INSERT INTO Youtube_Customer (CustomerKey, LastName, BirthDate, MaritalStatus, YearlyIncome, ModifiedDate)
  SELECT CustomerKey, LastName, BirthDate, MaritalStatus, YearlyIncome, ModifiedDate
  FROM Youtube_Custtrans
  WHERE ActionInd in ('A');

COMMIT;

In [18]:
conn.execute(sql)

In [68]:
pd.read_sql_query("select * from Youtube_Custtrans", conn)

,CustomerKey,LastName,BirthDate,MaritalStatus,YearlyIncome,ActionInd,ModifiedDate
0,11000,Yang,1971-10-06,M,250000.0,U,2020-01-01
1,11001,Jones,1976-05-10,S,360000.0,U,2019-02-01
2,11002,Torres,1971-02-09,M,60000.0,D,2020-02-01
3,333301,Murhpy,1975-02-09,M,33000.0,A,2018-01-01
4,333302,Jain,1980-01-09,M,28000.0,A,2020-02-01

In [19]:
pd.read_sql_query("SELECT * FROM Youtube_Customer ORDER BY CustomerKey", conn)

,CustomerKey,LastName,BirthDate,MaritalStatus,YearlyIncome,ModifiedDate,ETLLastUpdate
0,11000,Yang,1971-10-06,M,250000.0,2020-01-01,2021-06-28 09:16:40.170
1,11001,Jones,1976-05-10,S,360000.0,2019-02-01,2021-06-28 09:16:40.170
2,11003,Zhu,1973-08-14,S,70000.0,2019-01-01,2021-06-28 09:15:21.543
3,333301,Murhpy,1975-02-09,M,33000.0,2018-01-01,2021-06-28 09:16:40.170
4,333302,Jain,1980-01-09,M,28000.0,2020-02-01,2021-06-28 09:16:40.170

# Let's close the connection.

In [1]:
conn.dispose()

NameError: name 'conn' is not defined